# Задача 1

# a = tuple((input("Введите элементы кортежа: ")))
# print(a)
# print("Количество 2 =", a.count('2'))
# print("Количество 5 =", a.count('5'))
# print("Количество 3 =", a.count('3'))
# print("Количество 6 =", a.count('6'))
# print("Количество 1 =", a.count('1'))

# Задача 2


# def change(lst: list):
#     return tuple(reversed(list(set(lst))))
#
#
# print(change([1, 2, 3, 3, 2]))
# print(change([2, 1, 3, 1, 2, 5, 5, 9, 2, 0, 0]))


# Задача 2

# t = ('ab', 'abcd', 'cde', 'abc', 'def')
# print(t)
# a = input("Введите элемент: ")
# if a in t:
#     print('s =', a, '\nYes')
# else:
#     print("Такого элемента нет")
